Revit 2027 API
FilteredElementIdIterator Methods
The FilteredElementIdIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurrent |  The current element id found by the iterator.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next element id passing the filter.
Reset |  Resets the iterator to the beginning.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FilteredElementIdIterator Class
Autodesk.Revit.DB Namespace